import re

fuel_keywords = [
    '超级柴油','九五無鉛', '九二無鉛', '九八無鉛', '無鉛汽油', '超柴', '98號', '95號',
    '柴油', '九二', '九五', '九八', '92', '95', '98'
]
fuel_mapping = {
    '九五': '九五無鉛', '95': '九五無鉛', '九二': '九二無鉛', '92': '九二無鉛',
    '九八': '九八無鉛', '98': '九八無鉛', '超级柴油': '超級柴油', '超柴': '超級柴油',
    '柴油': '超級柴油',
}
fuel_fuzzy_mapping = {
    '無给': '無鉛', '无给': '無鉛', '無铅': '無鉛', '无铅': '無鉛', '柴油机': '柴油',
    '柴洒': '柴油', '超柴': '超級柴油', '超柴柴': '超級柴油', '九五無给': '九五無鉛',
    '九五無铅': '九五無鉛', '九二無给': '九二無鉛', '九八無给': '九八無鉛', '95+無给': '九五無鉛',
    '92+無给': '九二無鉛',  '98+無给': '九八無鉛', '超及柴油':'超級柴油', '超及柴油':'超級柴油'
}
district_keywords = ['台北', '台中', '高雄', '台南', '屏東', '新北', '桃園', '新竹', '宜蘭', '苗栗',
                     '彰化', '南投', '雲林', '嘉義', '台東', '花蓮', '金門', '連江', '澎湖']

# === 正則表達式預編譯 ===
invoice_number_pattern = re.compile(r'[A-Z]{2}-\d{8}')
date_pattern = re.compile(r'\d{4}-\d{2}-\d{2}')
quantity_pattern = re.compile(r'(\d+\.\d+)\s*[lL]')
quantity_fallback_pattern = re.compile(r'\d+\.\d+')
address_pattern = re.compile(
    r'(台|新北|屏東|高雄|台南|新竹|彰化|苗栗|宜蘭|雲林|南投|嘉義|花蓮|台東)[縣市]'
    r'.{0,10}(鄉|鎮|市|區).{0,20}(路|街|巷|大道).{0,20}\d+(號|号)?'
)
simple_quantity_pattern = re.compile(r'(\d+\.\d+)')